app/views/patients/show.html.erb

SELECT "bookings".* FROM "bookings" WHERE "bookings"."patient_id" = ?  [["patient_id", 1]]
---
<h2>Bookings</h2>
<% @patient.bookings.each do |booking| %>