app/views/doctors/show.html.erb

<h2>Bookings</h2>
<% @doctor.bookings.each do |booking| %>
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."doctor_id" = ?  [[nil, 1]]