app/controllers/bookings_controller.rb

 def index
    @patient = Patient.find(params[:patient_id])
---
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT 1  [["id", 1]]

  def show
    @patient = Patient.find(params[:patient_id])
    @booking = @patient.bookings.find(params[:id])
---
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT 1  [["id", 8]]
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."patient_id" = ? AND "bookings"."id" = ? LIMIT 1  [["patient_id", 8], ["id", 11]]

  def new
     @patient = Patient.find(params[:patient_id])
---
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT 1  [["id", 1]]

  def edit
     @patient = Patient.find(params[:patient_id])
    @booking= @patient.bookings.find(params[:id])
---
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT 1  [["id", 21]]
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."patient_id" = ? AND "bookings"."id" = ? LIMIT 1  [["patient_id", 21], ["id", 22]]

  def create
 @patient = Patient.find(params[:patient_id])
 @booking= @patient.bookings.build(params.require(:booking).permit(:details))
 if @booking.save
---
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "bookings" ("patient_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["patient_id", 1], ["created_at", "2015-12-07 18:40:39.477219"], ["updated_at", "2015-12-07 18:40:39.477219"]]