app/controllers/doctors_controller.rb

INSERT INTO "doctors" ("DoctorName", "Specialization", "HospitalName", "ADate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @doctor = Doctor.new(doctor_params)

    respond_to do |format|
      if @doctor.save

DELETE FROM "doctors" WHERE "doctors"."id" = ?  [["id", 3]]
---
  def destroy
    @doctor.destroy