app/controllers/patients_controller.rb

  def create
    @patient = Patient.new(patient_params)

    respond_to do |format|
      if @patient.save
---
INSERT INTO "patients" ("Name", "Age", "Height", "Weight", "BloodGroup", "Sugar", "BloodPressure", "RegDate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)