app/controllers/profiles_controller.rb

INSERT INTO "profiles" ("FirstName", "LastName", "City", "Country", "Pincode", "ContactNo", "Email", "user_id", "BirthDate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @profile = Profile.new(profile_params)

    respond_to do |format|
      if @profile.save

UPDATE "profiles" SET "ContactNo" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["ContactNo", 8989989], ["updated_at", "2015-12-07 16:46:16.244721"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @profile.update(profile_params)

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT 1  [["user_id", 4]]
---
  def signedinuserprofile
    profile = Profile.find_by_user_id(current_user.id)